/* Это комментарий.
 Он не влияет на работу программы */
// Это тоже комментарий только из одной строки.
#include <stdio.h> // Подключаем библиотеку ввода-вывода

                  /* глобальная переменная */
int main(void)          // Программа начинается тут. Это точка выполнения программы
{                       // Начало блока main
    int a, b, c, count; // объявление локальных переменных
    a = 10;
    b = 12;
     // Присвоить переменной a значение 10
    printf("Hello World"); // Напечатать текст Hello World

    return 0; // Завершить пр
}