// Проверка на простоту
// Дано натуральное число n ≥ 1. Проверьте, является ли оно простым. Программа должна вывести слово YES, если число простое или NO в противном случае. Необходимо составить рекурсивную функцию и использовать ее.
// int is_prime(int n, int delitel)

// Формат входных данных
// Натуральное число
// Формат результата
// YES или NO
// Примеры
// Входные данные
// 11
// Результат работы
// YES
// Входные данные
// 12
// Результат работы
// NO
// Входные данные
// 73
// Результат работы
// YES